base/InformationRegisters/СостоянияБронированияЗаявокНаКомандировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияБронированияЗаявокНаКомандировку</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБронированияЗаявокНаКомандировку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаКомандировку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКомандировку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/СостоянияБронированияЗаявокНаКомандировку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает состояние для заявки
//
// Параметры:
//    ЗаявкаНаКомандировку - ДокументСсылка.ЗаявкаНаКомандировку - Заявка на командировку
//    СостояниеЗаявки - ПеречислениеСсылка.СостоянияБронированияЗаявокНаКомандировку - Состояние заявки
//    ИнформацияОбОшибке - Строка - Дополнительная информация
//
Процедура УстановитьСостояние(ЗаявкаНаКомандировку, СостояниеЗаявки, ИнформацияОбОшибке = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.ЗаявкаНаКомандировку = ЗаявкаНаКомандировку;
	МенеджерЗаписи.Состояние = СостояниеЗаявки;
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		МенеджерЗаписи.Комментарий = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Определяет заявки для обновления статуса в сервисе бронирования
// 
// Возвращаемое значение:
//    Массив из ДокументСсылка.ЗаявкаНаКомандировку
//
Функция ЗаявкиВСтатусеОтправлена() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	ДанныеРегистра.ЗаявкаНаКомандировку КАК Ссылка
	|ИЗ
	|	РегистрСведений.СостоянияБронированияЗаявокНаКомандировку.СрезПоследних КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБронированияЗаявокНаКомандировку.Отправлена)
	|";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#КонецЕсли
